# YdCaret3 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..YdCaret3 Property
SymbolTypeId Class See Also
---
Symbol yd^3, indicating unit Cubic yards.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId YdCaret3 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property YdCaret3 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ YdCaret3 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace